InformationRegisters/ОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОповещенияПользователей/Ext/ManagerModule.bsl
&НаКлиенте
Функция ПолучитьСообщенияОбработкиОповещения(ЗавершитьРаботу = Ложь)  Экспорт
	
	Получатель=ПараметрыСеанса.ТекущийПользователь;	
	
	СтруктураОбработкиОповещения = РегистрыСведений.ОповещенияПользователей.СтруктураОбработкиОповещения();

	УстановитьПривилегированныйРежим(истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оповещения.НомерСообщения,
	|	Оповещения.Получатель,
	|	Оповещения.НачалоОповещения,
	|	Оповещения.КонецОповещения,
	|	Оповещения.Дата,
	|	Оповещения.ВремяПрочтения,
	|	Оповещения.Отправитель,
	|	Оповещения.Сообщение,
	|	Оповещения.Доставлено,
	|	Оповещения.Ответ,
	|	Оповещения.Тема,
	|	Оповещения.Прочитано
	|ИЗ
	|	РегистрСведений.ОповещенияПользователей КАК Оповещения
	|ГДЕ
	|	Оповещения.Получатель = &Получатель
	|	И &ТекДата МЕЖДУ Оповещения.НачалоОповещения И Оповещения.КонецОповещения
	|	И НЕ Оповещения.Прочитано";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Получатель",Получатель);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОбработкиОповещения,Выборка);
	Иначе 
		СтруктураОбработкиОповещения = Неопределено;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(ложь);
	
	Возврат СтруктураОбработкиОповещения;
КонецФункции


#Область УстановкаПараметровСеанса

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)Экспорт
	ИнициализацияПользователя();
КонецПроцедуры

Процедура ИнициализацияПользователя()
	
	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Если ТекПользователь.Имя = "" Тогда
		ИмяПользователя           = "НеАвторизован";
		ПолноеИмяПользователя     = "Не авторизован";
	Иначе
		ИмяПользователя           = ИмяПользователя();
		
		Если ПустаяСтрока(ПолноеИмяПользователя()) Тогда
			ПолноеИмяПользователя = ИмяПользователя;
		Иначе
			ПолноеИмяПользователя = ПолноеИмяПользователя();
		КонецЕсли;
	КонецЕсли;
	
	спрСсылка = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
	Если спрСсылка.Пустая() Тогда		
		спрОбъект = Справочники.Пользователи.СоздатьЭлемент();
		спрОбъект.Код = ИмяПользователя;
		спрОбъект.Наименование = ПолноеИмяПользователя;
		спрОбъект.Записать();		
		ПараметрыСеанса.ТекущийПользователь = спрОбъект.Ссылка;		
	Иначе		
		ПараметрыСеанса.ТекущийПользователь = спрСсылка;		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти 


       
#Область ОповещенияПользователеОбычноеПриложениеКлиент

Функция Инициализация(ПолеHTMLДокумента, Принудительно = Ложь) Экспорт
	
	Эксплорер = ПолеHTMLДокумента;
	
	ДвоичныеДанные 	= ПолучитьМакет("TinyMCE_zip");
	КаталогДанных  	= ПолучитьКаталогДанных();
	КаталогСкриптов = КаталогДанных + "tinymce\";
	ФайлАрхива 		= КаталогДанных + "TinyMCE.zip";
	
	ФайлКаталогСкриптов = Новый Файл(КаталогСкриптов);
	ФайлСкрипта = КаталогСкриптов + "tinyMCE\jscripts\tiny_mce\tiny_mce.js";
	Файл = Новый Файл(ФайлСкрипта);
	Если НЕ Принудительно И ФайлКаталогСкриптов.Существует() И Файл.Существует() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Файл = Новый Файл(КаталогСкриптов);
	Если НЕ Файл.Существует() Тогда
		СоздатьКаталог(КаталогСкриптов);
	КонецЕсли;
	
	Попытка
		ДвоичныеДанные.Записать(ФайлАрхива);
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Информация);
		Возврат Ложь;
	КонецПопытки;
	
	зип = Новый ЧтениеZipФайла(ФайлАрхива);
	зип.ИзвлечьВсе(КаталогСкриптов, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	УдалитьФайлы(ФайлАрхива);
	
	Возврат Истина;
КонецФункции

Процедура ПоказатьТекст(ПолеHTMLДокумента, Текст, Редактирование = Ложь, ФайлCSS = Неопределено) Экспорт
	
	КаталогДанных = ПолучитьКаталогДанных();

	ТекстНастроек = ПолучитьМакет("TinyMCE_txt").ПолучитьТекст();
	
	Т = Новый ТекстовыйДокумент;
	Т.ДобавитьСтроку("<HTML><HEAD><meta http-equiv=""Content-Type"" content=""text/html; charset=windows-1251"" content=""no-cache"">");
	Если Редактирование И ЗначениеЗаполнено(ТекстНастроек) Тогда
		Т.ДобавитьСтроку("<script type=""text/javascript"" src=""tinyMCE/tinyMCE/jscripts/tiny_mce/tiny_mce.js""></script>");
		Т.ДобавитьСтроку(ТекстНастроек);
		Т.ДобавитьСтроку("</HEAD><BODY><FONT FACE=""Arial"" SIZE=""-1"">");
		Т.ДобавитьСтроку("<form method=""\"" action=""\"" onsubmit=""return false;"">");
		Т.ДобавитьСтроку("<textarea id=""elm1"" name=""elm1"" style=""width: 100%;height:100%"">");
	Иначе
		Т.ДобавитьСтроку("</HEAD><BODY><FONT FACE=""Arial"" SIZE=""-1"">");
	КонецЕсли;
	
	Т.ДобавитьСтроку(Текст);
	
	Если Редактирование И ЗначениеЗаполнено(ТекстНастроек) Тогда
		Т.ДобавитьСтроку("</textarea>");
	КонецЕсли;
	
	Т.ДобавитьСтроку("</FONT></BODY></HTML>");
	
	Если ФайлCSS <> Неопределено Тогда
		Файл = Новый Файл(ФайлCSS);
		Если Файл.Существует() Тогда
			КопироватьФайл(ФайлCSS, КаталогДанных + "temp.css");
			
			ВремТекст = Т.ПолучитьТекст();
			ВремТекст = СтрЗаменить(ВремТекст, "[CSS]", КаталогДанных + "temp.css");
			Т.УстановитьТекст(ВремТекст);
		КонецЕсли;
	КонецЕсли;
			
	ВремФайл = КаталогДанных + "temp.html";
	Т.Записать(ВремФайл, КодировкаТекста.ANSI);
	
	ПолеHTMLДокумента.Перейти(ВремФайл);
КонецПроцедуры

Функция ПолучитьТекст(ПолеHTMLДокумента) Экспорт
	
	//ОбластьТекста = Эксплорер.Документ.getElementById("elm1");
	
	//HTMLКонтент = ПолеHTMLДокумента.Документ.parentWindow.eval("tinyMCE.activeEditor.getContent()");
	      // tinyMCE.triggerSave();tinyMCE.get('elm1').getContent();
    //К = ПолеHTMLДокумента.Документ.tinyMCE.activeEditor.getContent({ format: "text" });
	HTMLКонтент = ПолеHTMLДокумента.Документ.tinyMCE.activeEditor.getContent();
	
	Если HTMLКонтент = Неопределено Тогда
		//Сообщить("Не найдена область текста!", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	//Возврат ОбластьТекста.innerText;
	Возврат HTMLКонтент; 
	
КонецФункции

Функция ПолучитьКаталогДанных()

	Возврат КаталогВременныхФайлов() + "TinyMCE\";	

КонецФункции // ПолучитьКаталогДанных()


#КонецОбласти



#Область ОповещенияПользователейСервер
 
Функция ЗаписатьОповещение(НомерСообщения,СтруктураЗаписи)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Оповещение 					= РегистрыСведений.ОповещенияПользователей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Оповещение,СтруктураЗаписи);
	Оповещение.НомерСообщения = НомерСообщения;
	Оповещение.Записать();

	УстановитьПривилегированныйРежим(Ложь);	

КонецФункции // ЗаписатьОповещение()

Функция ЗаписатьОповещениеОДоставке(ПараметрыЗаписиОДоставке)Экспорт
	
	ПараметрыЗаписиОДоставке.Вставить("Доставлено",Истина);

	
	ЗаписатьОповещение(ПараметрыЗаписиОДоставке.НомерСообщения,ПараметрыЗаписиОДоставке);

КонецФункции // ЗаписатьОповещениеОДоставке()

Функция ПолучитьСледНомерОповещения()  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОповещенияПользователей.НомерСообщения
		|ИЗ
		|	РегистрСведений.ОповещенияПользователей КАК ОповещенияПользователей
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОповещенияПользователей.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НомерСообщения = ВыборкаДетальныеЗаписи.НомерСообщения;	
	Иначе
		НомерСообщения = 0;
	КонецЕсли;
	
	НомерСообщения = НомерСообщения+1;
	
	Возврат НомерСообщения;
	
КонецФункции // ПолучитьСледНомерСообщения()
 
Функция СтруктураОбработкиОповещения() Экспорт

	СтруктураОбработкиОповещения = Новый Структура(
	"НомерСообщения,Тема, Получатель,НачалоОповещения,КонецОповещения,Дата,ВремяПрочтения,Отправитель,Сообщение, Доставлено,Прочитано, Ответ,ТолькоПросмотр",
	Неопределено,Неопределено,Неопределено,Неопределено,Неопределено,Неопределено,Неопределено,"",Ложь,"",Ложь,Ложь);
	
	Возврат СтруктураОбработкиОповещения;
КонецФункции // ()

Процедура УдалитьВсеОповещенияНаСервере() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	НЗ = РегистрыСведений.ОповещенияПользователей.СоздатьНаборЗаписей();
	НЗ.Очистить();
	НЗ.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

Функция ПоказатьОтветПолучателя(Ответ) Экспорт

	Возврат ?(ЗначениеЗаполнено(Ответ),Ответ,
	"Мой дядя самых честных правил,
	|Когда не в шутку занемог,
	|Он уважать себя заставил
	|И лучше выдумать не мог.
	|Его пример другим наука;
	|Но, боже мой, какая скука
	|С больным сидеть и день и ночь,
	|Не отходя ни шагу прочь!
	|Какое низкое коварство
	|Полу-живого забавлять,
	|Ему подушки поправлять,
	|Печально подносить лекарство,
	|Вздыхать и думать про себя:
	|Когда же чорт возьмет тебя!");

КонецФункции // ()

Функция НайтиПользователя(СтрТЧ) Экспорт

    УИД = Новый УникальныйИдентификатор(СтрТЧ.ИдентификаторПользователяИБ);
    
    ОбъектМетаданных = Метаданные.Справочники["Пользователи"];
    ОбъектМенеджер   = Справочники.Пользователи;
    
    Если ЕстьРеквизит("ИдентификаторПользователяИБ",ОбъектМетаданных) Тогда
        
        Пользователь = ОбъектМенеджер.НайтиПоРеквизиту("ИдентификаторПользователяИБ",УИД);
        
    Иначе
        
        Пользователь = ОбъектМенеджер.НайтиПоКоду(СтрТЧ.Пользователь);
        
        Если Не ЗначениеЗаполнено(Пользователь) Тогда
        
        	Пользователь = ОбъектМенеджер.НайтиПоНаименованию(СтрТЧ.Пользователь);
        
        КонецЕсли; 

        Если Не ЗначениеЗаполнено(Пользователь) Тогда
        
        	Сообщить("Пользователь """+Пользователь+""" не найден.",СтатусСообщения.Важное);
        
        КонецЕсли; 

    КонецЕсли; 
    
    Возврат Пользователь;

КонецФункции // ()

Функция ЕстьРеквизит(ИмяРеквизита, ОбъектМетаданных) Экспорт
    
    Если ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
        Возврат Ложь;
    Иначе
        Возврат Истина;
    КонецЕсли; 
    
КонецФункции // ЕстьРеквизит()

#КонецОбласти
